#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

Show Plan

```terraform
null_resource.acr_soft_delete: Refreshing state... [id=5243043064206453679]
data.azurerm_resource_group.rg-default: Reading...
data.azurerm_resource_group.rg-default: Read complete after 1s [id=/subscriptions/df7ed44c-e98a-43c4-af18-241e33567262/resourceGroups/RG-UmeshPagar]
azurerm_user_assigned_identity.aks_identity: Refreshing state... [id=/subscriptions/df7ed44c-e98a-43c4-af18-241e33567262/resourceGroups/RG-UmeshPagar/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-identity]
azurerm_user_assigned_identity.acr_identity: Refreshing state... [id=/subscriptions/df7ed44c-e98a-43c4-af18-241e33567262/resourceGroups/RG-UmeshPagar/providers/Microsoft.ManagedIdentity/userAssignedIdentities/acr-identity]
module.virtual_network.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/df7ed44c-e98a-43c4-af18-241e33567262/resourceGroups/RG-UmeshPagar/providers/Microsoft.Network/virtualNetworks/vn-test-dev]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/df7ed44c-e98a-43c4-af18-241e33567262/resourceGroups/RG-UmeshPagar/providers/Microsoft.ContainerRegistry/registries/acractionseastus]
azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/df7ed44c-e98a-43c4-af18-241e33567262/resourceGroups/RG-UmeshPagar/providers/Microsoft.ContainerService/managedClusters/aks-eastus]
azurerm_role_assignment.acr_pull: Refreshing state... [id=/subscriptions/df7ed44c-e98a-43c4-af18-241e33567262/resourceGroups/RG-UmeshPagar/providers/Microsoft.ContainerRegistry/registries/acractionseastus/providers/Microsoft.Authorization/roleAssignments/5e30dfe1-daa7-dff0-b7a7-9d801c649bb4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # azapi_update_resource.enable_soft_delete will be created
  + resource "azapi_update_resource" "enable_soft_delete" {
      + body                    = jsonencode(
            {
              + properties = {
                  + softDeletePolicy = {
                      + retentionDays = 7
                      + status        = "enabled"
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = (known after apply)
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = "/subscriptions/df7ed44c-e98a-43c4-af18-241e33567262/resourceGroups/RG-UmeshPagar/providers/Microsoft.ContainerRegistry/registries/acractionseastus"
      + type                    = "Microsoft.ContainerRegistry/registries@2023-01-01-preview"
    }

  # azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/df7ed44c-e98a-43c4-af18-241e33567262/resourceGroups/RG-UmeshPagar/providers/Microsoft.ContainerService/managedClusters/aks-eastus"
        name                                = "aks-eastus"
        tags                                = {}
        # (34 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - max_surge = "10%" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # null_resource.acr_soft_delete will be destroyed
  # (because null_resource.acr_soft_delete is not in configuration)
  - resource "null_resource" "acr_soft_delete" {
      - id       = "5243043064206453679" -> null
      - triggers = {
          - "acr_id" = "/subscriptions/df7ed44c-e98a-43c4-af18-241e33567262/resourceGroups/RG-UmeshPagar/providers/Microsoft.ContainerRegistry/registries/acractionseastus"
        } -> null
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```



*Pusher: @Umesh-Pagar, Action: `pull_request`, Workflow: `Pull Request Main`*